jokes = (
    
    " ज़रुरत से ज्यादा भगवान को याद मत किया करो क्योंकि किसी दिन भगवान ने याद कर लिया तो.?? लेने के देने पड़ जायेंगे । ",

    " काम ऐसे करो कि लोग आपको. किसी दूसरे काम के लिए बोलें ही नहीं ",

    " आज के जमाने में सत्संग उसी संत का बढ़िया रहता है, जिसके पंडाल में गर्म पोहा, समोसा जलेबी और अदरक वाली चाय मिले। वरना ज्ञान तो अब ऑनलाइन उपलब्ध है । ",

    " जिस पुरुष ने आज के समय में बीवी, नौकरी और स्मार्टफोन को सम्भाल लिया हो, वह पुरुष नहीं महापुरुष कहलाता है ",

    " आज सबसे बड़ी कुर्बानी वह होती है, जब हम अपना फोन चार्जिंग से निकाल कर किसी और का फोन लगा दें । ",

    " आप कितने ही अच्छे काम कर लें, लेकिन लोग उसे ही याद करते हैं, जो उधार लेकर मरा हो । ",

    " आजकल माता-पिता को बस दो ही चिंताएं हैं… इंटरनेट पर उनका बेटा क्या डाउनलोड कर रहा है…. और… बेटी क्या अपलोड कर रही है । ",

    " English के अलावा हिंदी में भी कुछ शब्द Silent होते हैं। जैसे की अगर ध्यान दिया हो तो… , जब कोई दुकानदार भाव करते समय कहता है कि आपको ज्यादा नहीं लगाएंगे तो इसमें.. “चूना” शब्द Silent होता है. ",
            
    " एक लड़की एक लड़के के साथ बैठी थी, दूसरे दिन दूसरे लड़के के साथ बैठी थी, तीसरे दिन तीसरे लड़के के साथ बैठी थी, इस कहानी से तुम्हें क्या शिक्षा मिलती है? लड़के बदल जाते हैं पर लड़कियां नहीं ",

    " महिला बोली डॉक्टर साहब, मेरे पति नींद में बातें करने लगे हैं! क्या करूँ? डॉक्टर :- उन्हें दिन में बोलने का मौका दीजिए! ",

    " रक्षाबंधन पर लड़कियां किसी को भी भाई बना सकती हैं तो फिर करवाचौथ पर पति क्यों नही बनाती..? हमे इंसाफ चाहिए… *अब ये अफवाह कौन उड़ाया हैं कि * *मायावती रक्षाबंधन पर महागठबंधन के सभी नेताओ को ",

    " Sanskrit Teacher बोली, What is the meaning of तमसो मा ज्योर्तिगमय. Student बोला तू सो जा माँ, मैं ज्योति के घर जा रहा हुँ । ",

    " मरीज बोला, डॉक्टर साहब, मेरी दाई टांग में बहोत दर्द रहेता है. डॉक्टर बोला, ये तो उम्र का तकाजा है. मरीज बोला, लेकिन मेरी बाई टांग की भी तो उम्र उतनी ही है, फिर दाई टांग में ही तकलिफ क्यों ?? ",

    " प्रोफेसर बोला रमेश तूम बताओ, चाय नुकसानकारक है या फायदेमंद ?? Ramesh बोला, नुकसानकारक! प्रोफेसर बोला, राजू तूम बताओ. Raju बोला फायदेमंद. प्रोफेसर बोला पप्पू, तूम बताओ. Pappu बोला सर, अगर चाय पिलानी पड़़े तो नुकसानकारक है और मुफ्त में पीने को मिले तो फायदेमंद…!!! ",

    " जज बोला अच्छा, तो इस आदमी ने तुम्हें कौन-कौन सी गालियाँ दी. आदमी बोला जज साहब… वो सब गालियाँ शरीफों के सामने देने लायक नहीं है. वकील बोला अच्छा, तो हम सब यहाँ से चले जाते है. तूम जज को सुना दो. ",

    " Train में सांता का 100 रूपये गुम हो गये। तभी 1 मुसलमान बोला – “या अल्लाह बिसमिल्लाह” सांता – तुझे बीस मिला तो साला बाकी का 80 किसको मिला ",

    " कौन कहता है कि सिर्फ मोहब्बत में ही दर्द होता है । कमबख्त अभी दरवाजे में ऊंगली डालो तो पता चले क्या होता है ",

    "सान्ता ने बन्ता को थप्पड मार दिया… बन्ता बोला “ये तुने मजाक में मारा या #सच में मारा ?” सान्ता बोला “सच में मारा” बन्ता बोला “तो ठीक है, मुझे मजाक बिलकुल पसंद नहीं है”",

    '''सान्ता English के पेपर translation की वजह से फेल हो गया…
        प्रश्न थे…
        1. मैं एक आम आदमी हुँ ।
        सान्ता ने लिखा – I am a Mango Man.
        2. मुझे इंग्लिस आती है ।
        सान्ता ने लिखा – English Come to me
        3. मेरा तालुक हरिपुर हजारा से है ।
        सान्ता ने लिखा – I belong to Greenpur Thousanda.
        4. सड़क पर गोलियाँ चल रही थी ।
        सान्ता ने लिखा – Tablets are walking on the Road.'''
)

Shayari = (

    "अर्ज किया है... वो तुम्हें Dp दिखाकर गुमराह करेगी, मगर तुम आधार कार्ड पर अड़े रहना।",

    "काश प्यार का इन्शुरन्स हो जाता, प्यार करने से पहले प्रीमियम भरवाया जाता. प्यार में वफ़ा मिली तो ठीक वर्ना, बेवफाओं पे जो खर्चा होता उसका क्लेम तो मिल जाता।",

    "मेरी प्रेम कहानी का क्या अजीब एंडिंग था, मेरी प्रेम कहानी का क्या अजीब एंडिंग था, मैंने प्रोपोज़ किआ SMS से, कमबख्त वह उसकी शादी तक पेंडिंग था।",

    "ताजमहल किसी के लिए एक अजूबा है, तो किसी के लिए प्यार का एहसास है, हमारे तुम्हारे लिए तो बकवास है, क्यूँ की की रोज़ बदलती हमारी मुम्ताज़ है।",

    "अजब सी हालत है तेरे जाने के बाद, मुझे भूख लगती नहीं खाना खाने के बाद, मेरे पास दो ही समोसे थे जो मैंने खा लिए, एक तेरे आने से पहले, एक तेरे जाने के बाद।",

    "ए गुलाब अपनी खुशबू को मेरे दोस्तों पर न्योछावर कर दे, यह सर्दी के मौसम में अक्सर नहाया नहीं करते।",

    "देखा है तुम्हारे आगे, शर्मा के फूलों को मुरझाते, ए जहाँ को घायल करने वाले तुम डिओडोरेंट क्यों नहीं लगाते।",

    "आज कुछ शर्माए से लगते हो, सर्दी के कारण कपकपए से लगते हो, चेहरा आपका खिलखिलाये सा लगता है, हफ्ते के बाद नहाए से लगते हो।",

    "खुद का बच्चा रोये तो दिल में दर्द होता है, किसी और का रोये तो सर में दर्द होता है, खुद की बीवी रोये तो भी सर में दर्द होता है, किसी और की रोये तो दिल में दर्द होता है।",

    "जब हम उनके घर गए... कहने दिल से दिल लगा लो, उनकी माँ ने खोला दरवाजा, हम घवरा के बोले.. आंटी बच्चो को पोलियो ड्राप पिलवा लो।",

    "इश्क के चर्चे बहुत हैं दोस्तों, हुस्न के पर्चे बहुत है यारों, इश्क करने से पहले जान लेना, इसमें खर्चे बहुत है दोस्तो।",

    "कुछ बोलूं तो इतराते बहुत हो, जानेमन तुम मुस्कुराते बहुत हो, मन करता है तुम्हे दावत पर बुलाऊँ, लेकिन जानेमन तुम खाते बहुत हो।",

    "जब कोई ज़िन्दगी में बहुत ख़ास बन जाए, उसके बारे में सोचना ही उसका एहसास बन जाए, तो मांग लेना खुदा से उसे जिंदगी भर के लिए, इस से पहले की उसकी माँ किसी और की सास बन जाए।",

    "जब तिरछी नजरों से उन्होंने हमको देखा, तो हम मदहोश हो गए जब पता लगा उनकी नज़रें ही तिरछी हैं तो हम बेहोश हो गए।",

    "नजर न लग जाये आँखों में काजल लगा लो, हम कहते हैं आँखों में काजल ही नहीं, हो सके तो... गले में नीबू मिर्ची चप्पल भी लटका लो,",

    "मीठी मीठी यादों को पलकों पे सजा लेना, साथ गुज़रे लम्हों को दिल में बसा लेना, मैं तो बरसों का प्यासा हूँ, फराज़ बिजली आ जाये तो याद से मोटर चला देना।",

    "मेरी ख़ुशी के लम्हे इस कदर मुख़्तसर हैं फ़राज़, अभी मुजरा शुरू ही हुआ था के छापा पड़ गया।",

    "मासूम सी मुहब्बत का फ़राज़ बस इतना सा फ़साना है.. अम्मी घर से निकलने नहीं देती और मुझी डेट पर जाना है।",
    
    "मोहब्बत करते हैं लोग बड़े शोर के साथ, हमने भी बड़े जोर के साथ, लेकिन अब करेंगे थोड़ा गौर के साथ, क्योंकि कल उसे देखा है किसी और के साथ।",
    
    "दोस्तो हम उन्हें मुड़ मुड़कर देखते रहे, और वो हमें मुड़-मुड़ कर देखते रहे, वो हमें हम उन्हें, वो हमें हम उन्हें, क्योंकि परीक्षा में न उन्हें कुछ आता था न हमे।",

    "जब दरवाजा खोलने गये तो चेहरे पर हसी थी, दरवाजा खोला तो आँखों में आँसू दिल में बेबसी थी, ज्यादा मत सोच पगले, मेरी ऊँगली दरवाजे में फंसी थी,",

    "फिजाओं के बदलने का इंतज़ार मत कर, आँधियों के रुकने का इंतज़ार मत कर, पकड़ किसी को और फरार हो जा, पापा की पसंद का इंतज़ार मत कर",

    "आपकी याद में एक शायर अर्ज़ किया है, आज है मंगल कल था पीर-वह-वह, कभी तो कुछ भेजा कर फकीर",

    "इश्क में ख्याल बहुत है इश्क के चर्चे बहुत है, सोचते है हम भी करले इश्क पर सुना है इश्क में खर्चे बहुत है",

    "और भी चीजें बहुत सी लुट चुकी है दिल के साथ, ये बताया दोस्तों ने इश्क फरमाने के बाद, इसलिए कमरे की एक एक चीज़ चेक करता हूँ, एक तेरे आने से पहले एक तेरे जाने के बाद"
)

def joke():
    import random
    import os
    from gtts import gTTS
    from playsound import playsound
    jok = random.choice(jokes)
    tts = gTTS(text=jok, lang="hi", slow=False)
    filename = "my.mp3"
    tts.save(filename)
    playsound(filename)
    playsound("C:\\Users\\HP\\OneDrive\\Desktop\\AI\\Jarvis\\Jarvis 2.0.0\\Database\\sound\\funny.mp3")
    os.remove(filename)

def shay():
    import random
    import os
    from gtts import gTTS
    from playsound import playsound
    shay = random.choice(Shayari)
    tts = gTTS(text=shay, lang="hi", slow=False)
    filename = "my.mp3"
    tts.save(filename)
    playsound(filename)
    os.remove(filename)

